Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraints
A Dimension with Lock and/or EQ Constraints is being deleted, but the elements will still be constrained. Push Unconstrain to remove the Constraints or OK to leave elements constrained.